In [3]:
import pandas as pd

In [7]:
train = pd.read_csv('titanic_train.csv')
#train is dataframe and dataframe is a function

In [9]:
train.head()  #5 rows top

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [13]:
train.shape

(891, 12)

In [15]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
train.isnull().sum() #na.sum -- blank cells

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
#number entries
test_scores = pd.DataFrame({'Student_ID': [154,973,645],
                            'Science': [50,75,81], 'Geography': [88,100,66],
                            'Math': [72,86,94]})

test_scores

   Student_ID  Science  Geography  Math
0         154       50         88    72
1         973       75        100    86
2         645       81         66    94

In [9]:
type(test_scores)

pandas.core.frame.DataFrame

In [43]:
#text entries

survey = pd.DataFrame({'James': ['I liked it', 'more salt'], 'Emily': ['It is two sweet', 'Yum!']})
survey

        James            Emily
0  I liked it  It is two sweet
1   more salt             Yum!

In [13]:
#Index

test_scores = test_scores.set_index('Student_ID')
test_scores

            Science  Geography  Math
Student_ID
154              50         88    72
973              75        100    86
645              81         66    94

In [45]:
# create a dataframe via the index argument
survey = pd.DataFrame({'James': ['I liked it', 'more salt'], 'Emily': ['It is two sweet', 'Yum!']},
                      index = ['Product A', 'Product B'])
survey

                James            Emily
Product A  I liked it  It is two sweet
Product B   more salt             Yum!

In [47]:
# Reset index
# Try playing around with 'drop' and 'inplace' and see what they do 

survey.reset_index(drop=True)

        James            Emily
0  I liked it  It is two sweet
1   more salt             Yum!

In [49]:
survey

                James            Emily
Product A  I liked it  It is two sweet
Product B   more salt             Yum!

In [51]:
survey.reset_index(inplace=True,drop=True)

survey

        James            Emily
0  I liked it  It is two sweet
1   more salt             Yum!

In [53]:
# Renaming columns

test_scores.rename(columns = {'Geography': 'Physics', 'Science': 'Arts'}, inplace=True)
test_scores

            Arts  Physics  Math
Student_ID
154           50       88    72
973           75      100    86
645           81       66    94

In [57]:
# Drop the 'Math' column

test_scores.drop(columns='Math', inplace=True) #test_scores.drop("Math", axis=1,inplace=True)
test_scores

            Arts  Physics
Student_ID
154           50       88
973           75      100
645           81       66

In [59]:
# Drop row with Student_ID 973
#We can make this more robust once we learn the 'Loc' function in the coming weeks

test_scores.drop(973,inplace=True)
test_scores

            Arts  Physics
Student_ID
154           50       88
645           81       66

In [63]:
#Adding column and row

#Create a new column for history subject

test_scores['History'] = [79,70]
test_scores

            Arts  Physics  History
Student_ID
154           50       88       79
645           81       66       70

In [67]:
#Series       -------- only row (perticular column data)

pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [69]:
profit = pd.Series([75,80,66], index = ['2018 Profit', '2019 Profit', '2020 Profit'])
profit

2018 Profit    75
2019 Profit    80
2020 Profit    66
dtype: int64

In [73]:
customer_sales = pd.DataFrame([[317, 'Melbourne', '80'], [887, 'New York', '91'], [225, 'London', '50']])
customer_sales

     0          1   2
0  317  Melbourne  80
1  887   New York  91
2  225     London  50

In [75]:
customer_sales = pd.DataFrame([[317, 'Melbourne', '80'], [887, 'New York', '91'], [225, 'London', '50']],
                              columns = ['Customer_ID', 'City', 'Sales'])
customer_sales

   Customer_ID       City Sales
0          317  Melbourne    80
1          887   New York    91
2          225     London    50

In [ ]:
#customer_sales.rename(columns={"2":"text"})    ------------ To rename the column name